
* layer table



(setq LayerList '(
 ("CE-PAD-BNDY"		2	"HIDDEN2"	"EARTHWORKS : PAD BOUNDARY")
 ("CE-PAD-LEVL"		1	"CONTINUOUS"	"EARTHWORKS : PAD LEVEL")
 ("CE-CUT-LINE"		116	"DASHED2"	"EARTHWORKS : CUT TO EXTENTS LINE")
 ("CE-FILL-LINE"	253	"CONTINUOUS"	"EARTHWORKS : FILL TO EXTENTS LINE")
 ("CE-HTCH"		35	"DASHDOT2"	"EARTHWORKS : CUT OR FILL HATCH")
 ("CE-BATR-LINE"	1	"CONTINUOUS"	"EARTHWORKS : BATTER LINE")
 )
)


#+tblname: layer_table
| LAYER_NAME | COLOR | LINETYPE   | LINEWEIGHT |
|------------+-------+------------+------------|
| "0"        |     7 | CONTINUOUS |         15 |
| DASHED     |     8 | DASHED     |         15 |
| DIMENSION  |   162 | CONTINUOUS |         15 |
| STEEL      |     7 | CONTINUOUS |         15 |
| TEXT       |   162 | CONTINUOUS |         15 |
| CENTER     |     1 | CENTER     |         15 |

#+begin_src emacs-lisp :var tbl = layer_table :results code :tangle set_layers.lsp
(setq layer_table tbl)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
(("0" 7 "CONTINUOUS" 15)
 ("DASHED" 8 "DASHED" 15)
 ("DIMENSION" 162 "CONTINUOUS" 15)
 ("STEEL" 7 "CONTINUOUS" 15)
 ("TEXT" 162 "CONTINUOUS" 15)
 ("CENTER" 1 "CENTER" 15))
#+end_src

  


#+begin_src python :session *Python* :var v=layer_table
    acad = win32com.client.Dispatch("BricscadApp.AcadApplication")
    adoc = acad.ActiveDocument
    amodel = adoc.ModelSpace
    v
    for row in v:
	print(row)
	try:
	    nl = adoc.Layers.Add(row[0])
	    if row[2]!="Continuous":
		adoc.Linetypes.Load(row[2], 'iso.lin')
		nl.Linetype = row[2]
	    nl.color=row[1]
	    nl.lineweight=row[3]
	except:
	    pass

#+end_src

#+RESULTS:
(command "sh" "C:\\Users\\filip\\AppData\\Local\\Microsoft\\WindowsApps\\python.exe  c:\\Users\\filip\\AppData\\Roaming\\python\\cad2\\acad\\p_add_dimstyle.py")
 (command "sh" "C:\\Python27\python.exe  C:\\your_path\\your_python.PY")



python.exe  c:\Users\filip\AppData\Roaming\python\cad2\acad\p_add_dimstyle.py
